export const messages = {
  "en": {
    
    "label": (label: string, getAorAn: any) => `Please enter ${getAorAn} ${label.toLowerCase()}`,
    "label1": (label: string, getAorAn: any) => `Please select ${getAorAn} ${label.toLowerCase()}`,
    "min": (min: any) => `Min. length should be ${(min) }`,
    "fieldOrNormal":(getRemoteORField:any) => `First our ${getRemoteORField()} Remote team will prioritize your ticket to diagnose the issue.`,
    
  },
  "kn": {
    "TicketRaised": (ticketNo: string) =>
      ` ನಿಮ್ಮ ಟಿಕೆಟ್ ಯಶಸ್ವಿಯಾಗಿ ರೈಸ್ ಮಾಡಲಾಗಿದೆ!\nಟಿಕೇಟ್ ಸಂಖ್ಯೆ: ${ticketNo}\nನಿಮ್ಮ ವಿನಂತಿ ಪ್ರಕ್ರಿಯೆಗೊಳ್ಳುತ್ತಿದೆ. ಶೀಘ್ರದಲ್ಲಿ ಎಂಜಿನಿಯರ್ ನಿಯೋಜಿಸಲಾಗುವುದು.`,
    "TicketClosed": (ticketNo: string) =>
      `ನಿಮ್ಮ ಟಿಕೇಟ್ ಮುಚ್ಚಲಾಗಿದೆ!\nಟಿಕೇಟ್ ಸಂಖ್ಯೆ: ${ticketNo}\nನೀವು ಸಂಪರ್ಕಿಸಿದಕ್ಕಾಗಿ ಧನ್ಯವಾದಗಳು!`,
    "TicketInProgress": (ticketNo: string) =>
      `ನಿಮ್ಮ ಟಿಕೇಟ್ ಪ್ರಗತಿಯಲ್ಲಿ ಇದೆ!\nಟಿಕೇಟ್ ಸಂಖ್ಯೆ: ${ticketNo}\nನಮ್ಮ ತಂಡ ನಿಮ್ಮ ಟಿಕೇಟ್‌ನ್ನು ಪ್ರಗತಿಯಲ್ಲಿ ಕೈಗೊಳ್ಳುತ್ತಿದೆ ಮತ್ತು త్వరದಲ್ಲೇ ನಿಮ್ಮನ್ನು ನವೀಕರಿಸಲಿದೆ.`,
    "TicketAssigned": (ticketNo: string) =>
      `ನಿಮ್ಮ ಟಿಕೇಟ್ ನಿಯೋಜಿಸಲಾಗಿದೆ!\nಟಿಕೇಟ್ ಸಂಖ್ಯೆ: ${ticketNo}\nನಮ್ಮ ತಂಡ ಕೆಲವು ಗಂಟೆಗಳೊಳಗೆ ಸಂಪರ್ಕಿಸಲಿದೆ. ನಿಮ್ಮ ಸಹನೆಗೆ ಧನ್ಯವಾದಗಳು.`,
    "TicketNotResolved": (ticketNo: string) =>
      `ನಿಮ್ಮ ಟಿಕೇಟ್ ಇನ್ನೂ ಪರಿಹರಿಸಲಾಗಿಲ್ಲ!\nಟಿಕೇಟ್ ಸಂಖ್ಯೆ: ${ticketNo}\nದಯವಿಟ್ಟು ಕಾಯಿರಿ, ಇದನ್ನು ಹಿರಿಯ ಎಂಜಿನಿಯರ್‌ಗೆ ಹಸ್ತಾಂತರಿಸಲಾಗುವುದು.`,
    "TicketRequiresSpareParts": (ticketNo: string) =>
      `ನಿಮ್ಮ ಟಿಕೇಟ್‌ಗೆ ಸ್ಪೇರ್ ಭಾಗಗಳು ಅಗತ್ಯವಿದೆ!\nಟಿಕೇಟ್ ಸಂಖ್ಯೆ: ${ticketNo}\nದಯವಿಟ್ಟು ಕಾಯಿರಿ. ಒಂದು ಸ್ಪೇರ್ ಲಭ್ಯವಾದಾಗ, ನಾವು ಎಂಜಿನಿಯರ್ ಅನ್ನು ನಿಯೋಜಿಸೋಣ.`,
    "CustomerNotAvailable": (ticketNo: string) =>
      `ನಾವು ನಿಮ್ಮನ್ನು ಸಂಪರ್ಕಿಸಲು ಸಾಧ್ಯವಾಗಲಿಲ್ಲ!\nಟಿಕೇಟ್ ಸಂಖ್ಯೆ: ${ticketNo}\nನೀವು ಮತ್ತೊಮ್ಮೆ ಸಂಪರ್ಕಿಸಲು ಕಾಯಿರಿ. ಹೆಚ್ಚಿನ ಮಾಹಿತಿಗಾಗಿ, ದಯವಿಟ್ಟು ನಮ್ಮ ಬೆಂಬಲ ತಂಡವನ್ನು ಸಂಪರ್ಕಿಸು.`,
    "TicketOpened": (ticketNo: string) =>
      `ನಿಮ್ಮ ಟಿಕೇಟ್ ತೆರೆಯಲಾಗಿದೆ!\nಟಿಕೇಟ್ ಸಂಖ್ಯೆ: ${ticketNo}\nನಮ್ಮಿಂದ ಶೀಘ್ರದಲ್ಲೇ ಮತ್ತಷ್ಟು ಮಾಹಿತಿ ದೊರೆಯಲಿದೆ. ನಿಮ್ಮ ಸಹನೆಗೆ ಧನ್ಯವಾದಗಳು!`,
    "Pay": (ticketNo: string) =>
      `ಧನ್ಯವಾದಗಳು! ನಿಮ್ಮ ಪಾವತಿ ಸ್ವೀಕರಿಸಲಾಗಿದೆ,\nಟಿಕೇಟ್ ಸಂಖ್ಯೆ: ${ticketNo}\nನಾವು ಈಗ ನಿಮ್ಮ ಟಿಕೇಟ್ ಮುಚ್ಚುತ್ತಿದ್ದೇವೆ.`,
    "WorkCompleted": (ticketNo: string) =>
      `ನಿಮ್ಮ ಕೆಲಸ ಪೂರ್ಣಗೊಂಡಿದೆ!\nಟಿಕೇಟ್ ಸಂಖ್ಯೆ: ${ticketNo}\nಈ ಟಿಕೇಟ್ ಮುಚ್ಚಲು, ದಯವಿಟ್ಟು ಪಾವತಿ ಮುಂದುವರೆಯಿರಿ.`,
    "Default": (ticketNo: string) =>
      `ನಾವು ನಿಮ್ಮ ವಿನಂತಿಗೆ ಸಂಬಂಧಿಸಿದ ಯಾವುದೇ ಟಿಕೇಟ್ ಅನ್ನು ಕಂಡುಹಿಡಿಯಲಿಲ್ಲ.\nದಯವಿಟ್ಟು ಟಿಕೇಟ್ ರೈಸ್ ಮಾಡಿ, ಮತ್ತು ನಮ್ಮ ತಂಡ ಶೀಘ್ರದಲ್ಲೇ ನಿಮಗೆ ಸಹಾಯ ನೀಡುತ್ತದೆ.`,
    "label": (label: string) => `ದಯವಿಟ್ಟು ${label.toLowerCase()} ಅನ್ನು ನಮೂದಿಸಿ`,
    "label1": (label: string) => `ದಯವಿಟ್ಟು ಒಂದು ${label.toLowerCase()} ಆಯ್ಕೆಮಾಡಿ`,
   "min": (min: any,)=> `ಕನಿಷ್ಟ ಉದ್ದ ${(min)} ಅಕ್ಷರಗಳು ಇರಬೇಕು`,
 "fieldOrNormal":(getRemoteORField:any) => `ಮೊದಲು ನಮ್ಮ ${getRemoteORField()} ರಿಮೋಟ್ ತಂಡವು ನಿಮ್ಮ ಟಿಕೆಟ್ ಅನ್ನು ಪ್ರಾಥಮಿಕತೆ ನೀಡುತ್ತದೆ ಮತ್ತು ಸಮಸ್ಯೆಯನ್ನು ನಿರ್ಧರಿಸುತ್ತದೆ.`



  },
  "te": {
    "TicketRaised": (ticketNo: string) =>
      `మీ టికెట్ విజయవంతంగా పైలు చేయబడింది!\nటికెట్ సంఖ్య: ${ticketNo}\nమీ అభ్యర్థన ప్రాసెస్ అవుతోంది. త్వరలో ఒక ఇంజనీరును నియమిస్తాము.`,
    "TicketClosed": (ticketNo: string) =>
      `మీ టికెట్ మూసివేయబడింది!\nటికెట్ సంఖ్య: ${ticketNo}\nమీరు సంప్రదించడానికి ధన్యవాదాలు!`,
    "TicketInProgress": (ticketNo: string) =>
      `మీ టికెట్ ప్రగతిలో ఉంది!\nటికెట్ సంఖ్య: ${ticketNo}\nమా బృందం మీ టికెట్ పై పనిచేస్తుంది మరియు త్వరలో మీకు సమాచారం అందిస్తుంది.`,
    "TicketAssigned": (ticketNo: string) =>
      `మీ టికెట్ నియమించబడింది!\nటికెట్ సంఖ్య: ${ticketNo}\nమా బృందం కొన్ని గంటలలోగా మీకు సంప్రదిస్తుంది. మీ సహనానికి ధన్యవాదాలు.`,
    "TicketNotResolved": (ticketNo: string) =>
      `మీ టికెట్ ఇంకా పరిష్కరించబడలేదు!\nటికెట్ సంఖ్య: ${ticketNo}\nదయచేసి వేచి ఉండండి, ఇది సీనియర్ ఇంజనీరుకు తిరిగి అప్పగించబడుతుంది.`,
    "TicketRequiresSpareParts": (ticketNo: string) =>
      `మీ టికెట్‌కు స్పేర్ భాగాలు అవసరం!\nటికెట్ సంఖ్య: ${ticketNo}\nదయచేసి వేచి ఉండండి. స్పేర్ అందుబాటులో వచ్చినప్పుడు, మేము ఇంజనీరును నియమిస్తాము.`,
    "CustomerNotAvailable": (ticketNo: string) =>
      `మేము మీతో సంప్రదించలేకపోయాం!\nటికెట్ సంఖ్య: ${ticketNo}\nదయచేసి తిరిగి తిరిగి అప్పగించేందుకు వేచి ఉండండి. మరిన్ని వివరాల కోసం మా మద్దతు బృందంతో సంప్రదించండి.`,
    "TicketOpened": (ticketNo: string) =>
      `మీ టికెట్ తెరవబడింది!\nటికెట్ సంఖ్య: ${ticketNo}\nమేము త్వరలో మరిన్ని వివరాలతో మీకు సమాచారం అందిస్తాము. మీ సహనానికి ధన్యవాదాలు!`,
    "Pay": (ticketNo: string) =>
      `ధన్యవాదాలు! మీ చెల్లింపు అందుకోబడింది,\nటికెట్ సంఖ్య: ${ticketNo}\nమేము ఇప్పుడు మీ టికెట్‌ను మూసివేస్తున్నాము.`,
    "WorkCompleted": (ticketNo: string) =>
      `మీ పని పూర్తి అయింది!\nటికెట్ సంఖ్య: ${ticketNo}\nఈ టికెట్‌ను మూసివేయడానికి, దయచేసి చెల్లింపును కొనసాగించండి.`,
    "Default": (ticketNo: string) =>
      `మేము మీ అభ్యర్థనకు సంబంధించిన ఏవైనా టికెట్లు కనుగొనలేకపోయాం.\nదయచేసి ఒక టికెట్ నమోదు చేయండి, మరియు మా బృందం త్వరలో మీకు సహాయం చేస్తుంది.`,
    "label": (label: string) => `దయచేసి ${label.toLowerCase()} ను నమోదు చేయండి`,
    "label1": (label: string) => `దయచేసి ఒక ${label.toLowerCase()} ఎంచుకోండి`,
    "min": (min: any,)=> `కనీస పొడవు ${(min)} అక్షరాలు ఉండాలి`,

 "fieldOrNormal":(getRemoteORField:any) => `మొదట మా ${getRemoteORField()} రిమోట్ బృందం మీ టికెట్‌ను ప్రాధాన్యత ఇస్తుంది మరియు సమస్యను నిర్ధారిస్తుంది.`,
  },
  "ta": {
    "TicketRaised": (ticketNo: string) =>
      `உங்கள் டிக்கெட் வெற்றிகரமாக பதிவு செய்யப்பட்டது!\nடிக்கெட் எண்: ${ticketNo}\nஉங்கள் கோரிக்கை செயலாக்கத்தில் உள்ளது. விரைவில் ஒரு பொறியாளர் நியமிக்கப்படுவார்.`,
    "TicketClosed": (ticketNo: string) =>
      `உங்கள் டிக்கெட் மூடப்பட்டுள்ளது!\nடிக்கெட் எண்: ${ticketNo}\nநாம் தொடர்பு கொள்வதற்கு நன்றி!`,
    "TicketInProgress": (ticketNo: string) =>
      `உங்கள் டிக்கெட் தற்போது செயல்பாட்டில் உள்ளது!\nடிக்கெட் எண்: ${ticketNo}\nஎங்கள் குழு உங்கள் டிக்கெட்டில் பணியாற்றி வருகின்றது மற்றும் விரைவில் உங்களிடம் புதுப்பிப்புகள் வழங்கப்படும்.`,
    "TicketAssigned": (ticketNo: string) =>
      `உங்கள் டிக்கெட் ஒதுக்கப்பட்டுள்ளது!\nடிக்கெட் எண்: ${ticketNo}\nஎங்கள் குழு சில மணிநேரங்களில் உங்களுடன் தொடர்புகொள்வது. உங்கள் பொறுமைக்கு நன்றி.`,
    "TicketNotResolved": (ticketNo: string) =>
      `உங்கள் டிக்கெட் இன்னும் தீர்க்கப்படவில்லை!\nடிக்கெட் எண்: ${ticketNo}\nதயவுசெய்து காத்திருங்கள், இது மூத்த பொறியாளருக்கு ஒப்படைக்கப்படும்.`,
    "TicketRequiresSpareParts": (ticketNo: string) =>
      `உங்கள் டிக்கெட்டிற்கு மாற்று பாகங்கள் தேவை! \nடிக்கெட் எண்: ${ticketNo}\nதயவுசெய்து காத்திருங்கள். மாற்று பாகம் கிடைக்கும் பொழுது, நாங்கள் ஒரு பொறியாளரை நியமிக்கவேண்டியிருக்கும்.`,
    "CustomerNotAvailable": (ticketNo: string) =>
      `நாங்கள் உங்களை தொடர்புகொள்வதில் முடிவடையவில்லை!\nடிக்கெட் எண்: ${ticketNo}\nதயவுசெய்து மறுபடியும் திருப்பி ஒதுக்குவதற்காக காத்திருங்கள். கூடுதல் விவரங்களுக்கு, எங்கள் ஆதரவுக் குழுவை தொடர்பு கொள்ளவும்.`,
    "TicketOpened": (ticketNo: string) =>
      `உங்கள் டிக்கெட் திறக்கப்பட்டது!\nடிக்கெட் எண்: ${ticketNo}\nநாம் விரைவில் உங்களுக்கான புதிய தகவல்களுடன் எங்களை புதுப்பிக்கப்போகின்றோம். உங்கள் பொறுமைக்கு நன்றி!`,
    "Pay": (ticketNo: string) =>
      `நன்றி! உங்கள் கட்டணம் பெறப்பட்டுள்ளது,\nடிக்கெட் எண்: ${ticketNo}\nநாம் இப்போது உங்கள் டிக்கெட்டை மூடுகிறோம்.`,
    "WorkCompleted": (ticketNo: string) =>
      `உங்கள் வேலை முடிக்கப்பட்டது!\nடிக்கெட் எண்: ${ticketNo}\nஇந்த டிக்கெட்டை மூட, தயவுசெய்து கட்டணத்தை தொடரவும்.`,
    "Default": (ticketNo: string) =>
      `உங்கள் கோரிக்கைக்கு தொடர்புடைய எந்த டிக்கெட்டுகளையும் கண்டுபிடிக்க முடியவில்லை.\nதயவுசெய்து ஒரு டிக்கெட்டை பதிவு செய்யவும், எங்கள் குழு விரைவில் உங்களுக்கு உதவுவார்கள்.`,
    "label": (label: string) => `தயவுசெய்து ${label.toLowerCase()} ஐ உள்ளிடவும்`,
    "label1": (label: string) => `${label.toLowerCase()}ஐ தேர்வு செய்யவும்`,
    "min": (min: any) => `${(min)} எழுத்துகளுக்கு குறைந்தபட்ச நீளம் வேண்டும்`,
    "fieldOrNormal":(getRemoteORField:any) => `முதலில் எங்கள் ${getRemoteORField()} ரிமோட் குழு உங்கள் டிக்கெட்டை முன்னுரிமை அளிக்கும் மற்றும் பிரச்சினையை தீர்க்கும்.`,

  },
  "hi": {
    "TicketRaised": (ticketNo: string) =>
      `आपका टिकट सफलतापूर्वक उठाया गया है!\nटिकट संख्या: ${ticketNo}\nआपका अनुरोध प्रक्रिया में है। एक इंजीनियर शीघ्र ही असाइन किया जाएगा।`,
    "TicketClosed": (ticketNo: string) =>
      `आपका टिकट बंद हो गया है!\nटिकट संख्या: ${ticketNo}\nहमसे संपर्क करने के लिए धन्यवाद!`,
    "TicketInProgress": (ticketNo: string) =>
      `आपका टिकट वर्तमान में प्रगति में है!\nटिकट संख्या: ${ticketNo}\nहमारी टीम आपके टिकट पर काम कर रही है और जल्द ही आपको अपडेट करेगी।`,
    "TicketAssigned": (ticketNo: string) =>
      `आपका टिकट असाइन कर दिया गया है!\nटिकट संख्या: ${ticketNo}\nहमारी टीम कुछ घंटों में आपसे संपर्क करेगी। आपके धैर्य के लिए धन्यवाद।`,
    "TicketNotResolved": (ticketNo: string) =>
      `आपका टिकट अभी तक हल नहीं हुआ है!\nटिकट संख्या: ${ticketNo}\nकृपया प्रतीक्षा करें, इसे वरिष्ठ इंजीनियर को सौंपा जाएगा।`,
    "TicketRequiresSpareParts": (ticketNo: string) =>
      `आपके टिकट को स्पेयर पार्ट्स की आवश्यकता है!\nटिकट संख्या: ${ticketNo}\nकृपया प्रतीक्षा करें। जैसे ही स्पेयर उपलब्ध होगा, हम इंजीनियर को असाइन करेंगे।`,
    "CustomerNotAvailable": (ticketNo: string) =>
      `हम आपको संपर्क नहीं कर पाए!\nटिकट संख्या: ${ticketNo}\nकृपया फिर से असाइनमेंट के लिए प्रतीक्षा करें। अधिक जानकारी के लिए, आप हमारी सहायता टीम से संपर्क कर सकते हैं।`,
    "TicketOpened": (ticketNo: string) =>
      `आपका टिकट खोला गया है!\nटिकट संख्या: ${ticketNo}\nहम जल्द ही आपको और जानकारी देंगे। आपके धैर्य के लिए धन्यवाद!`,
    "Pay": (ticketNo: string) =>
      `धन्यवाद! आपकी भुगतान प्राप्त हो चुकी है,\nटिकट संख्या: ${ticketNo}\nहम अब आपका टिकट बंद कर रहे हैं।`,
    "WorkCompleted": (ticketNo: string) =>
      `काम पूरा हो चुका है!\nटिकट संख्या: ${ticketNo}\nइस टिकट को बंद करने के लिए, कृपया भुगतान जारी रखें।`,
    "Default": (ticketNo: string) =>
      `हम आपके अनुरोध से संबंधित कोई टिकट नहीं पा सके।\nकृपया एक टिकट उठाएं, और हमारी टीम जल्द ही आपकी सहायता करेगी।`,
    "label": (label: string) => `कृपया ${label.toLowerCase()} दर्ज करें`,
    "label1": (label: string) => `कृपया एक ${label.toLowerCase()} चुनें`,
    "min": (min: any) => `न्यूनतम लंबाई ${(min)} अक्षर होनी चाहिए`,
    "fieldOrNormal":(getRemoteORField:any) => `पहले हमारे ${getRemoteORField()} रिमोट टीम आपके टिकट को प्राथमिकता देती है और समस्या का समाधान करती है.`

  }




};